InformationRegisters/РасценкиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РасценкиЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗанятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаЦенЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасценкиЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасценкиЗанятий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗанятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасценкиЗанятий/Forms/ФормаУстановкиЦен/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Обучающийся") Тогда
		Обучающийся = Параметры.Обучающийся;
	КонецЕсли;
	АвтоматическиРассчитыватьПоДлительности = Истина;
	Преподаватель = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьТаблицуЦен();
КонецПроцедуры

Процедура ЗаполнитьТаблицуЦен()	
	
	ТаблицаРасценок = РегистрыСведений.РасценкиЗанятий.ПолучитьРасценкиЗанятий(Преподаватель, Обучающийся);
	
	ТаблицаЦен.Загрузить(ТаблицаРасценок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенЦенаПриИзменении(Элемент)
	
	Если НЕ АвтоматическиРассчитыватьПоДлительности Тогда Возврат; КонецЕсли;
	текСтрока = Элементы.ТаблицаЦен.ТекущиеДанные;
	
	РассчитатьСтоимостьПоДлительностиНаСервере(текСтрока.Цена, текСтрока.ДлительностьЗанятия);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтоимостьПоДлительностиНаСервере(Цена, ДлительностьЗанятия)

	СтоимостьМинуты = Цена / ДлительностьЗанятия.ЗначениеМинут;
	
	Для Каждого СтрЦена из ТаблицаЦен Цикл
		СтрЦена.Цена = СтрЦена.ДлительностьЗанятия.ЗначениеМинут * СтоимостьМинуты;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ПровестиИЗакрытьНаСервере();
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура ПровестиИЗакрытьНаСервере()
	
	НовДок = Документы.УстановкаЦенЗанятий.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	НовДок.Преподаватель = Преподаватель;
	
	Для Каждого СтрЦена из ТаблицаЦен Цикл
		НовСтр = НовДок.РасценкиЗанятий.Добавить();
		НовСтр.Обучающийся = Обучающийся;
		НовСтр.ДлительностьЗанятия = СтрЦена.ДлительностьЗанятия;
		НовСтр.Цена = СтрЦена.Цена;
	КонецЦикла;
	
	НовДок.Комментарий = "Установка цен для " + Строка(Обучающийся.Ссылка) + " от " + НовДок.Дата;
	НовДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
